app/Controllers/UserController.php


        $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);

        if ($userModel->insert($data)) {
---
INSERT INTO `user` (`username`, `lname`, `email`, `password`, `gender`, `city`, `mobile_number`, `profile_image`, `multiple_images`) VALUES ('sneha', 'makvana', 'sneha@gmail.com', '$2y$10$3FWO/QEw.4h2w4QLjgKoIezvy.EOG87cVMog5n7BU9hAJV40b9tl.', 'Female', 'USA', '1010101000', '1733547797_4f236403d06f20d612d0.webp', '[\"1733547797_3bb5a21c4571b04ea91e.webp\",\"1733547797_afb1fb18513d69b4946c.webp\"]')

    public function createLog()
    {
        $response = ['status' => false, 'message' => ''];

        if ($this->request->isAJAX()) {

            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');

            $validationRules = [
                'email' => 'required|valid_email',
                'password' => 'required|min_length[6]',
            ];

            if (!$this->validate($validationRules)) {
                return $this->response->setJSON([
                    'status' => 'error',
                    'errors' => $this->validator->getErrors()
                ]);
            }

            $userModel = new UserModel();
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'sneha@gmail.com'
 LIMIT 1